[
  {
    "id": 0,
    "title": "OpenClassrooms - Diplôme Développeur Web (Bac +2)",
    "years": "Mai à novembre 2023",
    "description": "Après quatre mois d'apprentissage en autodidacte, j'ai décidé de concrétiser mon projet de reconversion en suivant la formation Développeur Web d'OpenClassrooms. Celle-ci m'a permis de renforcer ma capacité d'autonomie, d'acquérir de solides compétences (JavaScript, React, Node.js...) et de les mettre en pratique grâce à des projets concrets. Aujourd'hui, je cherche une alternance Bac+3/4 sur le secteur de La Rochelle / Niort afin de poursuivre mon apprentissage de la programmation.",
    "lien": "https://openclassrooms.com/fr/paths/717-developpeur-web",
    "header": "https://storage.cloud.google.com/images_portfolio_steam/Openclassrooms.webp"
  },
  {
    "id": 1,
    "title": "Rédacteur web freelance",
    "years": "Septembre 2017 à janvier 2023",
    "description": "En tant que rédacteur freelance, j'ai principalement travaillé pour Clubic et jeuxvideo.com, premier site dédié au jeu vidéo en France où j'ai signé plus de 10 000 articles (tests, actualités, interviews...). Une expérience enrichissante qui m'a permis de gagner en autonomie et en rigueur.",
    "lien": "https://www.jeuxvideo.com/profil/clementoss?mode=page_perso",
    "header": "https://storage.cloud.google.com/images_portfolio_steam/jv.webp"
  },
  {
    "id": 2,
    "title": "ISCPA Paris - Diplôme Journaliste (Bac +3)",
    "years": "Septembre 2014 à août 2017",
    "description": "L'écriture et les médias ont été mes premiers amours. En suivant des études de journalisme, j'ai pu enrichir mes compétences rédactionnelles et les mettre en pratique au sein de rédactions variées (basketsession.com, hitek.fr, jeuxvideo.com...) lors de stages. Ces expériences m'ont également permis de développer mon sens de l'organisation, mon esprit d'analyse et ma capacité à trouver de l'information. Des qualités qui sont aussi essentielles pour un développeur.",
    "lien": "https://www.iscpa-ecoles.com/ecole-de-journalisme-paris/",
    "header": "https://storage.cloud.google.com/images_portfolio_steam/iscpa.webp"
  }
]
